In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
dframe = pd.DataFrame({'key1': ['a','a','b','b','a'],
                       'key2': ['first','second','first','second','first'],
                       'col1': np.random.randn(5),
                       'col2': np.random.randn(5)})

In [6]:

dframe

  key1    key2      col1      col2
0    a   first  0.575424 -0.308481
1    a  second  0.241778  1.031056
2    b   first  0.270247  2.517565
3    b  second  1.700185  0.753725
4    a   first  0.093713 -0.526189

In [7]:
group1 = dframe['col1'].groupby(dframe['key1'])

In [8]:

group1

In [9]:
group1.mean()

key1
a    0.303638
b    0.985216
Name: col1, dtype: float64

In [10]:
names = np.array(['Jane','Tom','Tom', 'Jane','Jane'])
years = np.array([1999, 1999, 1982, 1999, 1982])

In [11]:
dframe['col1'].groupby([names, years]).mean()

Jane  1982    0.093713
      1999    1.137804
Tom   1982    0.270247
      1999    0.241778
Name: col1, dtype: float64

In [12]:
dframe.groupby('key1').mean()

          col1      col2
key1
a     0.303638  0.065462
b     0.985216  1.635645

In [13]:
dframe.groupby(['key1','key2']).mean()

                 col1      col2
key1 key2
a    first   0.334568 -0.417335
     second  0.241778  1.031056
b    first   0.270247  2.517565
     second  1.700185  0.753725

In [14]:
dframe

  key1    key2      col1      col2
0    a   first  0.575424 -0.308481
1    a  second  0.241778  1.031056
2    b   first  0.270247  2.517565
3    b  second  1.700185  0.753725
4    a   first  0.093713 -0.526189

In [15]:
dframe.groupby(['key1','key2']).mean()

                 col1      col2
key1 key2
a    first   0.334568 -0.417335
     second  0.241778  1.031056
b    first   0.270247  2.517565
     second  1.700185  0.753725